RealtimeEngineering/contiki-ng/arch/platform/simplelink/cc13xx-cc26xx/smartsensor/cc1312r1/CC1312R1_SMARTSENSOR.c
/*
 *  =============================== AESCTR ===============================
 */
#include <ti/drivers/AESCTR.h>
#include <ti/drivers/aesctr/AESCTRCC26XX.h>

AESCTRCC26XX_Object aesctrCC26XXObjects[CC1312R1_SMARTSENSOR_AESCTRCOUNT];

const AESCTRCC26XX_HWAttrs aesctrCC26XXHWAttrs[CC1312R1_SMARTSENSOR_AESCTRCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCTR_Config AESCTR_config[CC1312R1_SMARTSENSOR_AESCTRCOUNT] = {
    {
         .object  = &aesctrCC26XXObjects[CC1312R1_SMARTSENSOR_AESCTR0],
         .hwAttrs = &aesctrCC26XXHWAttrs[CC1312R1_SMARTSENSOR_AESCTR0]
    },
};

const uint_least8_t AESCTR_count = CC1312R1_SMARTSENSOR_AESCTRCOUNT;

/*
 *  =============================== AESECB ===============================
 */
#include <ti/drivers/AESECB.h>
#include <ti/drivers/aesecb/AESECBCC26XX.h>

AESECBCC26XX_Object aesecbCC26XXObjects[CC1312R1_SMARTSENSOR_AESECBCOUNT];

const AESECBCC26XX_HWAttrs aesecbCC26XXHWAttrs[CC1312R1_SMARTSENSOR_AESECBCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESECB_Config AESECB_config[CC1312R1_SMARTSENSOR_AESECBCOUNT] = {
    {
         .object  = &aesecbCC26XXObjects[CC1312R1_SMARTSENSOR_AESECB0],
         .hwAttrs = &aesecbCC26XXHWAttrs[CC1312R1_SMARTSENSOR_AESECB0]
    },
};

const uint_least8_t AESECB_count = CC1312R1_SMARTSENSOR_AESECBCOUNT;

/*
 *  =============================== AESCTRDRBG ===============================
 */
#include <ti/drivers/AESCTRDRBG.h>
#include <ti/drivers/aesctrdrbg/AESCTRDRBGXX.h>

AESCTRDRBGXX_Object aesctrdrbgXXObjects[CC1312R1_SMARTSENSOR_AESCTRDRBGCOUNT];

const AESCTRDRBGXX_HWAttrs aesctrdrbgXXHWAttrs[CC1312R1_SMARTSENSOR_AESCTRDRBGCOUNT] = {
    {
        .aesctrIndex       = CC1312R1_SMARTSENSOR_AESCTR0,
    }
};

const AESCTRDRBG_Config AESCTRDRBG_config[CC1312R1_SMARTSENSOR_AESCTRDRBGCOUNT] = {
    {
         .object  = &aesctrdrbgXXObjects[CC1312R1_SMARTSENSOR_AESCTRDRBG0],
         .hwAttrs = &aesctrdrbgXXHWAttrs[CC1312R1_SMARTSENSOR_AESCTRDRBG0]
    },
};

const uint_least8_t AESCTRDRBG_count = CC1312R1_SMARTSENSOR_AESCTRDRBGCOUNT;

/*
 *  =============================== TRNG ===============================
 */
#include <ti/drivers/TRNG.h>
#include <ti/drivers/trng/TRNGCC26XX.h>

TRNGCC26XX_Object trngCC26XXObjects[CC1312R1_SMARTSENSOR_TRNGCOUNT];

const TRNGCC26XX_HWAttrs trngCC26X2HWAttrs[CC1312R1_SMARTSENSOR_TRNGCOUNT] = {
    {
        .intPriority       = ~0,
        .swiPriority       = 0,
        .samplesPerCycle   = 240000,
    }
};

const TRNG_Config TRNG_config[CC1312R1_SMARTSENSOR_TRNGCOUNT] = {
    {
         .object  = &trngCC26XXObjects[CC1312R1_SMARTSENSOR_TRNG0],
         .hwAttrs = &trngCC26X2HWAttrs[CC1312R1_SMARTSENSOR_TRNG0]
    },
};

const uint_least8_t TRNG_count = CC1312R1_SMARTSENSOR_TRNGCOUNT;

/*
 *  =============================== GPIO ===============================
 */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOCC26XX.h>

/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC1312R1_LAUNCHXL.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array. Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[] = {
    /* Input pins */

    /* Output pins */
    GPIOCC26XX_DIO_10 | GPIO_DO_NOT_CONFIG,  /* STM NRST */
    GPIOCC26XX_DIO_11 | GPIO_DO_NOT_CONFIG,   /* STM boot */

    /* SPI Flash CSN */
    GPIOCC26XX_DIO_03 | GPIO_DO_NOT_CONFIG,   /* SPI flash WP */
    GPIOCC26XX_DIO_04 | GPIO_DO_NOT_CONFIG,   /* SPI flash hold */
    GPIOCC26XX_DIO_06 | GPIO_DO_NOT_CONFIG,   /* SPI flash CS */
};

/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC1312R1_LAUNCH.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
    NULL,  /* Dummy */
};

const GPIOCC26XX_Config GPIOCC26XX_config = {
    .pinConfigs = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = CC1312R1_SMARTSENSOR_GPIOCOUNT,
    .numberOfCallbacks  = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority = (~0)
};

/*
 *  =============================== GPTimer ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/timer/GPTimerCC26XX.h>

GPTimerCC26XX_Object gptimerCC26XXObjects[CC1312R1_SMARTSENSOR_GPTIMERCOUNT];

const GPTimerCC26XX_HWAttrs gptimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_GPTIMERPARTSCOUNT] = {
    { .baseAddr = GPT0_BASE, .intNum = INT_GPT0A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT0, .pinMux = GPT_PIN_0A, },
    { .baseAddr = GPT0_BASE, .intNum = INT_GPT0B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT0, .pinMux = GPT_PIN_0B, },
    { .baseAddr = GPT1_BASE, .intNum = INT_GPT1A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT1, .pinMux = GPT_PIN_1A, },
    { .baseAddr = GPT1_BASE, .intNum = INT_GPT1B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT1, .pinMux = GPT_PIN_1B, },
    { .baseAddr = GPT2_BASE, .intNum = INT_GPT2A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT2, .pinMux = GPT_PIN_2A, },
    { .baseAddr = GPT2_BASE, .intNum = INT_GPT2B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT2, .pinMux = GPT_PIN_2B, },
    { .baseAddr = GPT3_BASE, .intNum = INT_GPT3A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT3, .pinMux = GPT_PIN_3A, },
    { .baseAddr = GPT3_BASE, .intNum = INT_GPT3B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT3, .pinMux = GPT_PIN_3B, },
};

const GPTimerCC26XX_Config GPTimerCC26XX_config[CC1312R1_SMARTSENSOR_GPTIMERPARTSCOUNT] = {
    { &gptimerCC26XXObjects[CC1312R1_SMARTSENSOR_GPTIMER0], &gptimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_GPTIMER0A], GPT_A },
    { &gptimerCC26XXObjects[CC1312R1_SMARTSENSOR_GPTIMER0], &gptimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_GPTIMER0B], GPT_B },
    { &gptimerCC26XXObjects[CC1312R1_SMARTSENSOR_GPTIMER1], &gptimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_GPTIMER1A], GPT_A },
    { &gptimerCC26XXObjects[CC1312R1_SMARTSENSOR_GPTIMER1], &gptimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_GPTIMER1B], GPT_B },
    { &gptimerCC26XXObjects[CC1312R1_SMARTSENSOR_GPTIMER2], &gptimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_GPTIMER2A], GPT_A },
    { &gptimerCC26XXObjects[CC1312R1_SMARTSENSOR_GPTIMER2], &gptimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_GPTIMER2B], GPT_B },
    { &gptimerCC26XXObjects[CC1312R1_SMARTSENSOR_GPTIMER3], &gptimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_GPTIMER3A], GPT_A },
    { &gptimerCC26XXObjects[CC1312R1_SMARTSENSOR_GPTIMER3], &gptimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_GPTIMER3B], GPT_B },
};

