RealtimeEngineering/contiki-ng/arch/platform/simplelink/cc13xx-cc26xx/smartsensor/cc1312r1/CC1312R1_SMARTSENSOR.c
/*
 *  =============================== Power ===============================
 */
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26X2.h>
#include "clock-arch.h"

const PowerCC26X2_Config PowerCC26X2_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &clock_arch_standby_policy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = true,
    .calibrateRCOSC_LF  = true,
    .calibrateRCOSC_HF  = true,
};

/*
 *  =============================== PWM ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>

PWMTimerCC26XX_Object pwmtimerCC26xxObjects[CC1312R1_SMARTSENSOR_PWMCOUNT];

const PWMTimerCC26XX_HwAttrs pwmtimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_PWMCOUNT] = {
    { .pwmPin = CC1312R1_SMARTSENSOR_PWMPIN0, .gpTimerUnit = CC1312R1_SMARTSENSOR_GPTIMER0A },
    { .pwmPin = CC1312R1_SMARTSENSOR_PWMPIN1, .gpTimerUnit = CC1312R1_SMARTSENSOR_GPTIMER0B },
    { .pwmPin = CC1312R1_SMARTSENSOR_PWMPIN2, .gpTimerUnit = CC1312R1_SMARTSENSOR_GPTIMER1A },
    { .pwmPin = CC1312R1_SMARTSENSOR_PWMPIN3, .gpTimerUnit = CC1312R1_SMARTSENSOR_GPTIMER1B },
    { .pwmPin = CC1312R1_SMARTSENSOR_PWMPIN4, .gpTimerUnit = CC1312R1_SMARTSENSOR_GPTIMER2A },
    { .pwmPin = CC1312R1_SMARTSENSOR_PWMPIN5, .gpTimerUnit = CC1312R1_SMARTSENSOR_GPTIMER2B },
    { .pwmPin = CC1312R1_SMARTSENSOR_PWMPIN6, .gpTimerUnit = CC1312R1_SMARTSENSOR_GPTIMER3A },
    { .pwmPin = CC1312R1_SMARTSENSOR_PWMPIN7, .gpTimerUnit = CC1312R1_SMARTSENSOR_GPTIMER3B },
};

const PWM_Config PWM_config[CC1312R1_SMARTSENSOR_PWMCOUNT] = {
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1312R1_SMARTSENSOR_PWM0], &pwmtimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_PWM0] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1312R1_SMARTSENSOR_PWM1], &pwmtimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_PWM1] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1312R1_SMARTSENSOR_PWM2], &pwmtimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_PWM2] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1312R1_SMARTSENSOR_PWM3], &pwmtimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_PWM3] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1312R1_SMARTSENSOR_PWM4], &pwmtimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_PWM4] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1312R1_SMARTSENSOR_PWM5], &pwmtimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_PWM5] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1312R1_SMARTSENSOR_PWM6], &pwmtimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_PWM6] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1312R1_SMARTSENSOR_PWM7], &pwmtimerCC26xxHWAttrs[CC1312R1_SMARTSENSOR_PWM7] },
};

const uint_least8_t PWM_count = CC1312R1_SMARTSENSOR_PWMCOUNT;

/*
 *  =============================== RF Driver ===============================
 */
#include <ti/drivers/rf/RF.h>

const RFCC26XX_HWAttrsV2 RFCC26XX_hwAttrs = {
    .hwiPriority        = ~0,       /* Lowest HWI priority */
    .swiPriority        = 0,        /* Lowest SWI priority */
    .xoscHfAlwaysNeeded = true,     /* Keep XOSC dependency while in standby */
    .globalCallback     = NULL,     /* No board specific callback */
    .globalEventMask    = 0         /* No events subscribed to */
};

/*
 *  =============================== SD ===============================
 */
#include <ti/drivers/SD.h>
#include <ti/drivers/sd/SDSPI.h>

#if TI_SD_CONF_ENABLE

#if !(TI_SPI_CONF_SPI0_ENABLE)
#error "SD driver requires SPI0 enabled"
#endif

SDSPI_Object sdspiObjects[CC1312R1_SMARTSENSOR_SDCOUNT];

const SDSPI_HWAttrs sdspiHWAttrs[CC1312R1_SMARTSENSOR_SDCOUNT] = {
    {
        .spiIndex = CC1312R1_SMARTSENSOR_SPI0,
        .spiCsGpioIndex = CC1312R1_SMARTSENSOR_SDSPI_CS
    }
};

const SD_Config SD_config[CC1312R1_SMARTSENSOR_SDCOUNT] = {
    {
        .fxnTablePtr = &SDSPI_fxnTable,
        .object = &sdspiObjects[CC1312R1_SMARTSENSOR_SDSPI0],
        .hwAttrs = &sdspiHWAttrs[CC1312R1_SMARTSENSOR_SDSPI0]
    },
};

const uint_least8_t SD_count = CC1312R1_SMARTSENSOR_SDCOUNT;

#endif /* TI_SD_CONF_ENABLE */

/*
 *  =============================== SPI DMA ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC26X2DMA.h>

#if TI_SPI_CONF_ENABLE

SPICC26X2DMA_Object spiCC26X2DMAObjects[CC1312R1_SMARTSENSOR_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to 0xFF
 * to satisfy the SDSPI driver requirement.
 */
const SPICC26X2DMA_HWAttrs spiCC26X2DMAHWAttrs[CC1312R1_SMARTSENSOR_SPICOUNT] = {
#if TI_SPI_CONF_SPI0_ENABLE
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = CC1312R1_SMARTSENSOR_SPI0_MOSI,
        .misoPin            = CC1312R1_SMARTSENSOR_SPI0_MISO,
        .clkPin             = CC1312R1_SMARTSENSOR_SPI0_CLK,
        .csnPin             = CC1312R1_SMARTSENSOR_SPI0_CSN,
        .minDmaTransferSize = 10
    },
#endif
#if TI_SPI_CONF_SPI1_ENABLE
    {
        .baseAddr           = SSI1_BASE,
        .intNum             = INT_SSI1_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin            = CC1312R1_SMARTSENSOR_SPI1_MOSI,
        .misoPin            = CC1312R1_SMARTSENSOR_SPI1_MISO,
        .clkPin             = CC1312R1_SMARTSENSOR_SPI1_CLK,
        .csnPin             = CC1312R1_SMARTSENSOR_SPI1_CSN,
        .minDmaTransferSize = 10
    },
#endif
};

const SPI_Config SPI_config[CC1312R1_SMARTSENSOR_SPICOUNT] = {
#if TI_SPI_CONF_SPI0_ENABLE
    {
         .fxnTablePtr = &SPICC26X2DMA_fxnTable,
         .object      = &spiCC26X2DMAObjects[CC1312R1_SMARTSENSOR_SPI0],
         .hwAttrs     = &spiCC26X2DMAHWAttrs[CC1312R1_SMARTSENSOR_SPI0]
    },
#endif
#if TI_SPI_CONF_SPI1_ENABLE
    {
         .fxnTablePtr = &SPICC26X2DMA_fxnTable,
         .object      = &spiCC26X2DMAObjects[CC1312R1_SMARTSENSOR_SPI1],
         .hwAttrs     = &spiCC26X2DMAHWAttrs[CC1312R1_SMARTSENSOR_SPI1]
    },
#endif
};

const uint_least8_t SPI_count = CC1312R1_SMARTSENSOR_SPICOUNT;

